---
kind: other
id: Methods.T:Autodesk.Revit.DB.GeometryObject
source: html/4a6e6e9a-94c2-2c0d-4541-7913c53bc849.htm
---
# GeometryObject Methods

Causes the object to release immediately any resources it may be utilizing.